backend/tests/load/transfer/transfer-1000.yml
config:
  target: "http://localhost:4000"
  phases:
    # Test 1000 transfers trong 60 giây (ramp up từ 10 -> 20 requests/s)
    - duration: 30
      arrivalRate: 10
      rampTo: 20
      name: "Ramp up: 10 to 20 transfers/second"
    # Sustain 20 requests/s trong 30 giây
    - duration: 30
      arrivalRate: 20
      name: "Sustained: 20 transfers/second"
  processor: "./processor.js"
  variables:
    authToken: ""
    senderBankId: ""
    receiverBankId: ""

scenarios:
  - name: "High volume transfers between 2 bank accounts"
    flow:
      # Lấy auth token và bank IDs
      - function: "setAuthData"
      
      # Thực hiện transfer
      - post:
          url: "/api/transactions/create"
          headers:
            Content-Type: "application/json"
            Cookie: "{{ authToken }}"
          json:
            senderBankId: "{{ senderBankId }}"
            receiverBankId: "{{ receiverBankId }}"
            amount: "{{ $randomNumber(10, 100) }}"
            name: "High Volume Load Test"
            channel: "online"
            category: "Transfer"
          capture:
            - json: "$.transaction.id"
              as: "transactionId"
            - json: "$.sender.balance"
              as: "senderBalance"
            - json: "$.receiver.balance"
              as: "receiverBalance"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: transaction
      
      # Đổi chiều chuyển khoản để giữ balance cân bằng
      - think: 1
      
      - post:
          url: "/api/transactions/create"
          headers:
            Content-Type: "application/json"
            Cookie: "{{ authToken }}"
          json:
            senderBankId: "{{ receiverBankId }}"
            receiverBankId: "{{ senderBankId }}"
            amount: "{{ $randomNumber(10, 100) }}"
            name: "Reverse Transfer"
            channel: "online"
            category: "Transfer"
          expect:
            - statusCode: 200
            - contentType: json