backend/tests/load/transfer/transfer-10000.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 10
      arrivalRate: 300  # 100 request/giây = 1000 requests trong 10s
      name: "High load: 50 transfers/second"
    - duration: 10
      arrivalRate: 300  # 100 request/giây = 1000 requests trong 10s
      name: "Sustained: 50 transfers/second"
  processor: "./processor.js"

scenarios:
  - name: "High volume transfers between 2 bank accounts"
    weight: 100
    flow:
      - function: "loadTestData"
      - post:
          url: "/api/auth/signin"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "authToken"
      - think: 1
      - post:
          url: "/api/transactions/create"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            sourceAccountId: "{{ sourceAccountId }}"
            destinationAccountId: "{{ destinationAccountId }}"
            amount: "{{ amount }}"
            name: "Load Test Transfer"
          expect:
            - statusCode: 
                - 200
                - 429
                - 503